In [2]:
import pandas as pd

In [3]:
sr=pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data=[1,2,3,4,5]
sr=pd.Series(data,index=[10,20,30,40,50])
sr

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [5]:
import numpy as np
data=np.array([[1,2,3,4,5],[10,20,30,40,50]])

In [6]:
df=pd.DataFrame(data)
df

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

In [7]:
df=pd.DataFrame(data,index=['row1','row2'])
df

       0   1   2   3   4
row1   1   2   3   4   5
row2  10  20  30  40  50

In [30]:
df=pd.read_excel("C:/Users/Sowdhamini/OneDrive/Documents/forpandas.xlsx")
df

   eno     ename  esalary     eid elocation edesignation
0    1  sowjanya    15000  119923      bngl           oe
1    2   sridevi    15000  235687       mys           se
2    3    sowdhi    15000  456709       hyd           se
3    4  prasanna    15000  125677   chennai           oe
4    5    bhagya    15000  127845    mumbai           ds
5    6     lasya    15000  658734      pune           da

In [31]:
df.head() # first four rows

   eno     ename  esalary     eid elocation edesignation
0    1  sowjanya    15000  119923      bngl           oe
1    2   sridevi    15000  235687       mys           se
2    3    sowdhi    15000  456709       hyd           se
3    4  prasanna    15000  125677   chennai           oe
4    5    bhagya    15000  127845    mumbai           ds

In [32]:
df.tail()

   eno     ename  esalary     eid elocation edesignation
1    2   sridevi    15000  235687       mys           se
2    3    sowdhi    15000  456709       hyd           se
3    4  prasanna    15000  125677   chennai           oe
4    5    bhagya    15000  127845    mumbai           ds
5    6     lasya    15000  658734      pune           da

In [33]:
print(df.ename)#print particular col

0    sowjanya
1     sridevi
2      sowdhi
3    prasanna
4      bhagya
5       lasya
Name: ename, dtype: object

In [35]:
df.drop('eid',axis = 'columns') # delete the col

   eno     ename  esalary elocation edesignation
0    1  sowjanya    15000      bngl           oe
1    2   sridevi    15000       mys           se
2    3    sowdhi    15000       hyd           se
3    4  prasanna    15000   chennai           oe
4    5    bhagya    15000    mumbai           ds
5    6     lasya    15000      pune           da

In [37]:
df.drop('eid',axis='columns').head() # delete the col

   eno     ename  esalary elocation edesignation
0    1  sowjanya    15000      bngl           oe
1    2   sridevi    15000       mys           se
2    3    sowdhi    15000       hyd           se
3    4  prasanna    15000   chennai           oe
4    5    bhagya    15000    mumbai           ds

In [43]:
df["esalary"][3]="50000"
df

    eno     ename esalary     eid elocation edesignation
0  enum  sowjanya   15000  119923      bngl           oe
1     2   sridevi   15000  235687       mys           se
2     3    sowdhi   15000  456709       hyd           se
3     4  prasanna   50000  125677   chennai           oe
4     5    bhagya   15000  127845    mumbai           ds
5     6     lasya   15000  658734      pune           da

In [49]:
df["esalary"]>3

TypeError: '>' not supported between instances of 'str' and 'int'

In [ ]:
#iloc & loc

In [ ]:
df.iloc[:,:]  #index

In [ ]:
df.loc